In [1]:
# Importing the packages

import pandas as pd
import numpy as pd
import matplotlib.pyplot as plt
import seaborn as sns
import time
import os

In [2]:
# Reading the dataset

import pandas as pd
df = pd.read_csv('../Dataset/sanFran.csv')
print("The dataset has {} rows and {} columns.".format(df.shape[0], df.shape[1]))

The dataset has 2215024 rows and 33 columns.

In [3]:
# Selecting wanted attributes from the dataset

df = df[['DayOfWeek', 'Date', 'Time', 'PdDistrict', 'Resolution', 'X', 'Y', 'Location']]
df.head(3)

,DayOfWeek,Date,Time,PdDistrict,Resolution,X,Y,Location
0,Friday,04/15/2011,16:00,TARAVAL,LOCATED,-122.476328,37.719687,POINT (-122.476327815126 37.7196874952717)
1,Thursday,03/26/2009,12:28,SOUTHERN,"ARREST, BOOKED",-122.411340,37.781271,POINT (-122.411339562557 37.7812707434494)
2,Friday,02/15/2013,02:00,PARK,"ARREST, BOOKED",-122.435188,37.762670,POINT (-122.435187699349 37.7626702770872)

In [4]:
# Converting dates to datetime format and extracting details

df['DateTime'] = df['Date'] + " " + df['Time']
df['DateTime'] = pd.to_datetime(df['DateTime']) 

df['year'] = pd.DatetimeIndex(df['DateTime']).year
df['month'] = pd.DatetimeIndex(df['DateTime']).month
df['date'] = pd.DatetimeIndex(df['DateTime']).date
df['time'] = pd.DatetimeIndex(df['DateTime']).time

In [5]:
# Re-selecting wanted attributes from the dataset

df = df[['DayOfWeek', 'PdDistrict', 'Resolution', 'X', 'Y', 'Location', 'DateTime', 'year', 'month', 'date', 'time']]

In [6]:
# Changing the column names for ease

df.columns = ['day', 'district', 'result', 'x', 'y', 'location', 'datetime', 'year', 'month', 'date', 'time']
print(df.columns)

Index(['day', 'district', 'result', 'x', 'y', 'location', 'datetime', 'year',
       'month', 'date', 'time'],
      dtype='object')

In [7]:
# Inspecting the data

print("The dataframe has {} rows and {} columns.".format(df.shape[0], df.shape[1]))
df.head(2)

The dataframe has 2215024 rows and 11 columns.

,day,district,result,x,y,location,datetime,year,month,date,time
0,Friday,TARAVAL,LOCATED,-122.476328,37.719687,POINT (-122.476327815126 37.7196874952717),2011-04-15 16:00:00,2011,4,2011-04-15,16:00:00
1,Thursday,SOUTHERN,"ARREST, BOOKED",-122.411340,37.781271,POINT (-122.411339562557 37.7812707434494),2009-03-26 12:28:00,2009,3,2009-03-26,12:28:00

In [8]:
# Inspecting neighbourhood counts

df.district.value_counts()

SOUTHERN      399785
MISSION       300076
NORTHERN      272713
CENTRAL       226255
BAYVIEW       221000
INGLESIDE     194180
TENDERLOIN    191746
TARAVAL       166971
PARK          125479
RICHMOND      116818
Name: district, dtype: int64

In [9]:
# Inspecting year counts

df.year.value_counts()

2015    156526
2017    154773
2013    152806
2016    150883
2014    150128
2003    149176
2004    148148
2005    142186
2008    141311
2012    140847
2009    139860
2006    137853
2007    137639
2010    133523
2011    132697
2018     46668
Name: year, dtype: int64

In [10]:
# Checking for null values

df.isnull().sum()

day         0
district    1
result      0
x           0
y           0
location    0
datetime    0
year        0
month       0
date        0
time        0
dtype: int64

In [11]:
df = df[df['district'].notna()]

In [12]:
# Saving the clean dataset

df.to_csv('../Dataset/sanFran_clean.csv')